app/helpers/matches_helper.rb

SELECT "players".* FROM "players"
---
    def player_id_field(match)
        if match.player.nil?
            select_tag "match[player_id]", options_from_collection_for_select(Player.all, :id, :username, match.player_id)

SELECT "opponents".* FROM "opponents"
---
    def opponent_id_field(match)
        select_tag "match[opponent_id]", options_from_collection_for_select(Opponent.all, :id, :username)

SELECT "games".* FROM "games" WHERE "games"."match_id" = ?  [["match_id", 1]]
---
    def match_scores(match)
        @match_scores = []
        match.games.each do |g|

SELECT "games".* FROM "games" WHERE "games"."match_id" = ?  [["match_id", 14]]
---
    def match_status(match)
        player_wins = 0
        opponent_wins = 0
        match.games.each do |g|

SELECT COUNT(*) FROM "matches" WHERE "matches"."player_id" = $1  [["player_id", 1]]
SELECT "matches".* FROM "matches" WHERE "matches"."player_id" = ?  [["player_id", 1]]
---
    def win_percentage(player)
        if player.matches.count == 0
            "No matches yet. Get started!"
        else
            (match_wins(player).to_f / player.matches.count.to_f).round(2)

SELECT "matches".* FROM "matches" WHERE "matches"."player_id" = $1  [["player_id", 1]]
---
    def match_wins(player)
        @match_wins = 0
        @match_losses = 0
        player.matches.each do |m|

SELECT "matches".* FROM "matches" WHERE "matches"."player_id" = $1  [["player_id", 1]]
---
    def match_losses(player)
        @match_wins = 0
        @match_losses = 0
        player.matches.each do |m|

SELECT "games".* FROM "games" WHERE "games"."match_id" = $1  [["match_id", 4]]
---
    def game_wins(match)
        @game_wins = 0
        @game_losses = 0
        match.games.each do |g|