app/helpers/matches_helper.rb

    def game_wins(match)
        @game_wins = 0
        @game_losses = 0
        match.games.each do |g|
---
SELECT "games".* FROM "games" WHERE "games"."match_id" = $1  [["match_id", 6]]