app/helpers/players_helper.rb

    def ranking_update(player)
        if player.matches.count == 0
            player.ranking
        else
            @player_ranking = player.ranking
            @opponent_ranking = player.matches.last.opponent.ranking
            if match_status(player.matches.last) == "Won"
---
SELECT COUNT(*) FROM "matches" WHERE "matches"."player_id" = ?  [["player_id", 2]]
SELECT  "matches".* FROM "matches" WHERE "matches"."player_id" = ? ORDER BY "matches"."id" DESC LIMIT ?  [["player_id", 2], ["LIMIT", 1]]
SELECT  "matches".* FROM "matches" WHERE "matches"."player_id" = $1 ORDER BY "matches"."id" DESC LIMIT $2  [["player_id", 4], ["LIMIT", 1]]

                        @opponent_ranking -= 50
                    end
                    player.save
                    player.matches.last.opponent.save
---
SELECT  "matches".* FROM "matches" WHERE "matches"."player_id" = $1 ORDER BY "matches"."id" DESC LIMIT $2  [["player_id", 1], ["LIMIT", 1]]

                end

            elsif
                match_status(player.matches.last) == "Lost"
---
SELECT  "matches".* FROM "matches" WHERE "matches"."player_id" = ? ORDER BY "matches"."id" DESC LIMIT ?  [["player_id", 1], ["LIMIT", 1]]

                    end
                end
            player[:ranking] = @player_ranking
            player.matches.last.opponent.ranking = @opponent_ranking
---
SELECT  "matches".* FROM "matches" WHERE "matches"."player_id" = ? ORDER BY "matches"."id" DESC LIMIT ?  [["player_id", 1], ["LIMIT", 1]]