app/views/players/show.html.erb

SELECT COUNT(*) FROM "games" INNER JOIN "matches" ON "games"."match_id" = "matches"."id" WHERE "matches"."player_id" = $1  [["player_id", 2]]
---

                <p>Total number of games:<%= @player.games.count %></p>

SELECT "matches".* FROM "matches" WHERE "matches"."player_id" = $1  [["player_id", 1]]
---
                            </tr>
                            <% @player.matches.each do |m| %>