app/views/players/show.html.erb

            </tr>
            <% @player.matches.each do |m| %>
---
SELECT "matches".* FROM "matches" WHERE "matches"."player_id" = ?  [["player_id", 1]]