app/controllers/application_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def current_player
        if session[:player_id]
            @current_player = Player.find_by(:id => session[:player_id])