app/controllers/matches_controller.rb

    def destroy
        find_match
        @match.destroy
---
DELETE FROM "matches" WHERE "matches"."id" = ?  [["id", 13]]

    def find_match
        @match = Match.find_by(:id => params[:id])
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 13], ["LIMIT", 1]]