app/controllers/matches_controller.rb

    def show
        if params[:player_id]
        	@match = Player.find(params[:player_id]).matches.find(params[:id])
        else
        	@match = Match.find(params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def new
        #If there is a player_id in params and the player_id does not exist in datebase, redirect to players index.
        if params[:player_id] && !Player.exists?(params[:player_id])
---
SELECT "players".* FROM "players"

    def create
        @match = Match.new(match_params)

        @match.games.each do |g|
            g.opponent_id = @match.opponent_id
        end

        if @match.save
            flash[:success] = "Match added successfully!"
            redirect_to match_path(@match)
        else
            flash[:errors] = @match.errors.full_messages.join(", ")
---
SELECT  "matches".* FROM "matches" ORDER BY "matches"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "games".* FROM "games" WHERE "games"."match_id" = ?  [["match_id", 4]]
INSERT INTO "games" ("match_id", "player_id", "player_score", "opponent_id", "opponent_score", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["match_id", 10], ["player_id", 1], ["player_score", 9], ["opponent_id", 1], ["opponent_score", 11], ["created_at", "2019-10-08 16:27:11.375798"], ["updated_at", "2019-10-08 16:27:11.375798"]]
INSERT INTO "matches" ("player_id", "opponent_id", "match_type", "created_at", "updated_at", "notes", "date") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["player_id", 1], ["opponent_id", 1], ["match_type", "1"], ["created_at", "2019-10-08 16:27:11.374556"], ["updated_at", "2019-10-08 16:27:11.374556"], ["notes", "Testing."], ["date", "2019-10-08"]]
SELECT "opponents".* FROM "opponents"
SELECT "games".* FROM "games" WHERE "games"."match_id" = ?  [["match_id", 16]]

    def edit
        if params[:player_id] && !Player.exists?(params[:player_id])
---
SELECT "players".* FROM "players"

    def update
        #before_action
        @match.update(only_match_params)
        #Lines 54-77 is one big work around but it works well.
        @games = @match.games
        @games.each do |g|
---
UPDATE "matches" SET "date" = $1, "opponent_id" = $2, "updated_at" = $3 WHERE "matches"."id" = $4  [["date", "2019-10-13"], ["opponent_id", 6], ["updated_at", "2019-10-14 14:24:36.022939"], ["id", 22]]
SELECT "games".* FROM "games" WHERE "games"."match_id" = $1  [["match_id", 18]]

    def destroy
        #before_action
        @match.destroy
---
DELETE FROM "matches" WHERE "matches"."id" = $1  [["id", 18]]

    def find_match
        @match = Match.find_by(:id => params[:id])
---
SELECT  "matches".* FROM "matches" WHERE "matches"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

    def update_wins_and_losses(match)
        @game_wins = 0
        @game_losses = 0

        match.games.each do |g|
            if g.player_score > g.opponent_score
                @game_wins += 1
            else
                @game_losses += 1
            end
        end

        @player = match.player
        @opponent = match.opponent

        if @game_wins > @game_losses
            @player.wins += 1
            @opponent.losses += 1
        else
            @opponent.wins += 1
            @player.losses += 1
        end
        @player.save
        @opponent.save
---
SELECT "games".* FROM "games" WHERE "games"."match_id" = $1  [["match_id", 2]]
UPDATE "players" SET "losses" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["losses", 4], ["updated_at", "2019-10-08 16:27:11.381807"], ["id", 1]]
UPDATE "opponents" SET "losses" = $1, "updated_at" = $2 WHERE "opponents"."id" = $3  [["losses", 12], ["updated_at", "2019-10-11 16:16:08.058377"], ["id", 1]]

    def update_ranking(match)
        @player = match.player
        @opponent = match.opponent

        if @player.matches.count == 0
---
SELECT COUNT(*) FROM "matches" WHERE "matches"."player_id" = $1  [["player_id", 1]]

                        @player.ranking += 50
                        @opponent.ranking -= 50
                    end
                    @player.save
                    @opponent.save
---
UPDATE "players" SET "ranking" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["ranking", 1730], ["updated_at", "2019-10-11 17:24:07.995581"], ["id", 3]]
UPDATE "opponents" SET "ranking" = $1, "updated_at" = $2 WHERE "opponents"."id" = $3  [["ranking", 1780], ["updated_at", "2019-10-11 17:24:07.998071"], ["id", 4]]

                    @player.save
                    @opponent.save
                end
            elsif match_status(@player.matches.last) == "Lost"
---
SELECT  "matches".* FROM "matches" WHERE "matches"."player_id" = $1 ORDER BY "matches"."id" DESC LIMIT $2  [["player_id", 1], ["LIMIT", 1]]

                        @opponent.ranking += 0
                        @player.ranking -= 0
                    end
                    @player.save
                    @opponent.save
---
UPDATE "players" SET "ranking" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["ranking", 1081], ["updated_at", "2019-10-08 16:27:11.392071"], ["id", 1]]
UPDATE "opponents" SET "ranking" = $1, "updated_at" = $2 WHERE "opponents"."id" = $3  [["ranking", 1219], ["updated_at", "2019-10-08 16:27:11.394614"], ["id", 1]]

                        @opponent.ranking += 50
                        @player.ranking -= 50
                    end
                    @player.save
                    @opponent.save
---
UPDATE "players" SET "ranking" = $1, "updated_at" = $2 WHERE "players"."id" = $3  [["ranking", 1760], ["updated_at", "2019-10-11 16:48:53.120889"], ["id", 3]]
UPDATE "opponents" SET "ranking" = $1, "updated_at" = $2 WHERE "opponents"."id" = $3  [["ranking", 1640], ["updated_at", "2019-10-11 16:48:53.124326"], ["id", 3]]