app/controllers/opponents_controller.rb

    def new
        @opponent = Opponent.new
        @opponents = Opponent.all
---
SELECT "opponents".* FROM "opponents" WHERE (ranking >= 1900 AND ranking <= 2299)

    def create
        @opponent = Opponent.new(opponent_params)

        if @opponent.save
---
INSERT INTO "opponents" ("username", "ranking", "gender", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Leon"], ["ranking", 2100], ["gender", "Male"], ["created_at", "2019-10-11 16:09:00.228655"], ["updated_at", "2019-10-11 16:09:00.228655"]]

    def edit
        @opponent = Opponent.find_by(:id => params[:id])
---
SELECT  "opponents".* FROM "opponents" WHERE "opponents"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def update
        @opponent = Opponent.find_by(:id => params[:id])

        if @opponent.update(opponent_params)
---
SELECT  "opponents".* FROM "opponents" WHERE "opponents"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "opponents" SET "username" = $1, "ranking" = $2, "gender" = $3, "updated_at" = $4 WHERE "opponents"."id" = $5  [["username", "Matilda"], ["ranking", 1500], ["gender", "Female"], ["updated_at", "2019-10-13 18:40:56.802586"], ["id", 5]]