app/controllers/players_controller.rb

    def show
        @player = Player.find_by(:id => params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def find_player
        @player = Player.find_by(:id => params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]