app/controllers/players_controller.rb

    def create
        @player = Player.new(player_params)

        if @player.save
---
INSERT INTO "players" ("username", "email", "ranking", "gender", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def update
        #before_action
        @player.update(player_params)
---
UPDATE "players" SET "email" = ?, "ranking" = ?, "password_digest" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["email", "moe@moe.com"], ["ranking", 1300], ["password_digest", "$2a$12$1nPut/2CDtldIwkF4Afohe51M53A7LBw7WtMrSq8.Sjp7lXMlxZRG"], ["updated_at", "2019-09-30 21:26:00.282778"], ["id", 1]]

    def find_player
        @player = Player.find_by(:id => params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]