app/controllers/sessions_controller.rb

    def create
        if auth_hash # Logged in through OAuth
            oauth_nickname = auth_hash[:info][:nickname].downcase
            # Since GitHub doesn't want to give me an email value, this creates Player by using "nickname" instead. The email & password is generated with the nickname value.
            if @player = Player.find_by(:username => oauth_nickname)
                session[:player_id] = @player.id # Logs player in.
                flash[:success] = "OAuth login successful!"
                redirect_to player_path(@player), notice: "Logged in!"
            else
                @player = Player.new(:email => "#{oauth_nickname}@#{oauth_nickname}.com", :gender => "Male", :password => SecureRandom.hex(10), :username => oauth_nickname, :ranking => 1000)
                if @player.save
---
SELECT  "players".* FROM "players" WHERE "players"."username" = $1 LIMIT $2  [["username", "BaronLip"], ["LIMIT", 1]]
INSERT INTO "players" ("username", "email", "ranking", "gender", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

            # end
        else
            # Standard login process
            @player = Player.find_by_email(params[:email])
---
SELECT  "players".* FROM "players" WHERE "players"."email" = $1 LIMIT $2  [["email", "moe@moe.com"], ["LIMIT", 1]]