app/models/match.rb

INSERT INTO "games" ("id", "match_id", "player_id", "player_score", "opponent_score", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["id", 48], ["match_id", 16], ["player_id", 2], ["player_score", 11], ["opponent_score", 6], ["created_at", "2019-10-01 18:32:52.452018"], ["updated_at", "2019-10-01 18:32:52.452018"]]
SELECT  "games".* FROM "games" WHERE "games"."id" = ? AND "games"."match_id" = ? AND "games"."player_id" = ? AND "games"."player_score" = ? AND "games"."opponent_id" = ? AND "games"."opponent_score" = ? LIMIT ?  [["id", 44], ["match_id", 14], ["player_id", nil], ["player_score", 9], ["opponent_id", nil], ["opponent_score", 11], ["LIMIT", 1]]
---
    def games_attributes=(games_attributes)
        games_attributes.values.each do |game_attributes|

            #Second attempt:
            game = Game.find_or_create_by(game_attributes) unless game_attributes[:player_score].blank? || game_attributes[:opponent_score].blank?